 gcc -g p1original.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x842: file p1original.c, line 19.
(gdb) r
Starting program: /home/runner/ppa-IA2-practice2-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1original.c:19
19  {
(gdb) n
21    input(&b,&h);
(gdb) s
input (base=0x7ffd9b634b5c, height=0x7ffd9b634b60) at p1original.c:5
5     printf("Enter the length of the base of a triangle\n");
(gdb) n
Enter the length of the base of a triangle
6     scanf("%f",base);
(gdb) n
7
7     printf("Enter the height of the triangle\n");
(gdb) n
Enter the height of the triangle
8     scanf("%f",height);
(gdb) n
6
9   }
(gdb) n
main () at p1original.c:22
22    find_area(b,h,&a);
(gdb) s
find_area (base=7, height=6, area=0x7ffd9b634b64) at p1original.c:12
12    *area=0.5*base*height;
(gdb) n
13  }
(gdb) n
main () at p1original.c:23
23    output(b,h,a);
(gdb) s
output (base=7, height=6, area=21) at p1original.c:16
16    printf("The area of the triangle with base %f and height %f is %f\n",base,height,area);
(gdb) n
The area of the triangle with base 7.000000 and height 6.000000 is 21.000000
17  }
(gdb) n
main () at p1original.c:24
24    return 0;
(gdb) p a
$1 = 21
(gdb) p b
$2 = 7
(gdb) p h
$3 = 6
(gdb) c
Continuing.
[Inferior 1 (process 70) exited normally]
(gdb) q